webhook-project/app/background_jobs/background_job/webhook/status_check.rb

SELECT "webhooks".* FROM "webhooks" WHERE "webhooks"."id" = $1 LIMIT $2  [["id", "2e6c7eb8-cea8-4b36-9354-05125058fb56"], ["LIMIT", 1]]
UPDATE "webhooks" SET "status" = $1 WHERE "webhooks"."id" = $2  [["status", 0], ["id", "2e6c7eb8-cea8-4b36-9354-05125058fb56"]]
UPDATE "webhooks" SET "status" = $1 WHERE "webhooks"."id" = $2  [["status", 1], ["id", "2e6c7eb8-cea8-4b36-9354-05125058fb56"]]
UPDATE "webhooks" SET "status" = $1 WHERE "webhooks"."id" = $2  [["status", 2], ["id", "2e6c7eb8-cea8-4b36-9354-05125058fb56"]]
---
  def perform(webhook_id)
    webhook = Webhook.find(webhook_id)
    webhook.update!(status: "unknown")
    webhook.broadcast_update
    sleep 1
    webhook.update!(status: "checking")
    webhook.broadcast_update
    sleep 1
    webhook.update!(status: "active")