webhook-project/app/controllers/webhooks_controller.rb

  def create
    webhook = Webhook.new(webhook_params)
    if webhook.save
---
INSERT INTO "webhooks" ("user_id", "url", "status") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", "b1c03c46-bc93-42c5-8f1c-d03489b7116e"], ["url", "https://b5a3-203-45-126-27.ngrok.io/zepto_callback"], ["status", 0]]

  def destroy
    webhook.destroy
---
DELETE FROM "webhooks" WHERE "webhooks"."id" = $1  [["id", "2e6c7eb8-cea8-4b36-9354-05125058fb56"]]