webhook-project/app/views/pages/dashboard.html.erb

    <%= turbo_frame_tag "webhook_frame" do %>
      <% if current_user.webhook.present? %>
---
SELECT "webhooks".* FROM "webhooks" WHERE "webhooks"."user_id" = $1 LIMIT $2  [["user_id", "b1c03c46-bc93-42c5-8f1c-d03489b7116e"], ["LIMIT", 1]]